Ks_1.9/0/Ub
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Ub;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.26 0 0);

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform (0.26 0 0);
        redirectType    turbulentUbInletProfile;

        codeInclude
        #{
            #include "fvCFD.H"
        #};

        code
        #{
            const fvPatch& boundaryPatch = patch();
            const vectorField& Cf = boundaryPatch.Cf();
            vectorField& field = *this;

            forAll(Cf, faceI)
            {
                scalar y = Cf[faceI].y();
                scalar ratio = Foam::max(0.0, y) / 0.10;
                // 1/7th power law for fully-developed turbulent boundary layer profile
                // Centerline velocity = (8/7) * V_bulk = (8/7) * 0.26 = 0.2971 m/s
                scalar u_x = 0.2971 * Foam::pow(ratio, 1.0/7.0);
                field[faceI] = vector(u_x, 0, 0);
            }
        #};
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0.26 0 0);
    }

    bed
    {
        type            noSlip;
    }

    top
    {
        type            slip;
    }

    bridge
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
